backend/app/Services/PrometheusMetricsService.php

select count(*) as aggregate from "users" where "users"."deleted_at" is null
select count(*) as aggregate from "invoices"
select count(*) as aggregate from "campaigns" where "status" in ('sending', 'completed', 'sent')
select count(*) as aggregate from "failed_jobs"
---
    private function collectApplicationMetrics(): void
    {
        $this->setGauge('koomky_active_users_total', (float) User::query()->count());
        $this->setGauge('koomky_invoices_generated_total', (float) Invoice::query()->count());
        $this->setGauge(
            'koomky_campaigns_sent_total',
            (float) Campaign::query()->whereIn('status', ['sending', 'completed', 'sent'])->count()
        );

        if (Schema::hasTable('jobs')) {
            $queueRows = DB::table('jobs')
                ->select('queue', DB::raw('COUNT(*) as waiting'))
                ->groupBy('queue')
                ->get();

            if ($queueRows->isEmpty()) {
                $this->setGauge('koomky_queue_jobs_waiting', 0, ['queue' => 'default']);
            } else {
                foreach ($queueRows as $row) {
                    $this->setGauge('koomky_queue_jobs_waiting', (float) $row->waiting, ['queue' => (string) $row->queue]);
                }
            }
        } else {
            $this->setGauge('koomky_queue_jobs_waiting', 0, ['queue' => 'default']);
        }

        $processed = 0.0;
        if (Schema::hasTable('failed_jobs')) {
            $processed += (float) DB::table('failed_jobs')->count();

select count(*) as aggregate from "campaign_recipients" where "status" in ('sent', 'delivered')
---
        }

        $emailsSent = Schema::hasTable('campaign_recipients')
            ? (float) CampaignRecipient::query()->whereIn('status', ['sent', 'delivered'])->count()